# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv11-HS-BiMA Hybrid: A novel architecture using HS-FPN as the main body,
# enhanced with a BiMA-FPN-inspired bottom-up path for bidirectional feature fusion.

# Parameters
nc: 80  # number of classes
scales:  # model compound scaling constants
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Shared parameters
head_channel: 512  # HS-FPN often uses a larger channel count
fusion_mode: bifpn # Using the fusion module from BiMA-FPN

# YOLOv11n backbone (Unchanged)
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]   # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]   # 3-P3/8
  - [-1, 2, C3k2, [head_channel, False, 0.25]] # 4
  - [-1, 1, Conv, [head_channel, 3, 2]]   # 5-P4/16
  - [-1, 2, C3k2, [head_channel, True]] # 6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 2, C3k2, [1024, True]] # 8
  - [-1, 1, SPPF, [1024, 5]]      # 9
  - [-1, 2, C2TSSA_DYT_Mona_EDFFN, [1024]]        # 10

# Hybrid Head: HS-FPN structure with a new BiMA-FPN bottom-up path
head:
  # =========================================================================
  #  Part 1: HS-FPN Style Top-Down Path (The "Main Body")
  # =========================================================================
  # Process P5 from backbone
  - [10, 1, ELA_HSFPN, []]                # 11
  - [-1, 1, nn.Conv2d, [head_channel, 1]] # 12 (P5_out1) - First stage P5 output

  # Upsample P5 and fuse with P4
  - [12, 1, nn.ConvTranspose2d, [head_channel, 3, 2, 1, 1]] # 13 (Upsampled P5)
  - [6, 1, ELA_HSFPN, []]                 # 14 (Processed P4 from backbone)
  - [-1, 1, nn.Conv2d, [head_channel, 1]] # 15
  - [13, 1, ELA_HSFPN, [False]]           # 16 (Attention map from upsampled P5)
  - [[15, 16], 1, Multiply, []]           # 17 (Gating P4 with P5's attention)
  - [[-1, 13], 1, Add, []]                # 18 (Residual connection)
  - [-1, 2, C3k2, [head_channel, False]]  # 19 (P4_out1) - First stage P4 output

  # Upsample P4 and fuse with P3
  - [19, 1, nn.ConvTranspose2d, [head_channel, 3, 2, 1, 1]] # 20 (Upsampled P4)
  - [4, 1, ELA_HSFPN, []]                 # 21 (Processed P3 from backbone)
  - [-1, 1, nn.Conv2d, [head_channel, 1]] # 22
  - [20, 1, ELA_HSFPN, [False]]           # 23 (Attention map from upsampled P4)
  - [[22, 23], 1, Multiply, []]           # 24 (Gating P3 with P4's attention)
  - [[-1, 20], 1, Add, []]                # 25 (Residual connection)
  - [-1, 2, C3k2, [head_channel, False]]  # 26 (P3_out) - Final P3 output

  # =========================================================================
  #  
  # =========================================================================
  # Downsample P3 and fuse with P4_out1 to create a new, refined P4
  - [26, 1, Conv, [head_channel, 3, 2]]       # 27 (Downsampled P3)
  - [[-1, 19], 1, Fusion, [fusion_mode]]      # 
  - [-1, 2, C3k2, [head_channel, False]]      # 29 (P4_out) - Final P4 output

  # Downsample refined P4 and fuse with P5_out1 to create a new, refined P5
  - [29, 1, Conv, [head_channel, 3, 2]]       # 30 (Downsampled P4)
  - [[-1, 12], 1, Fusion, [fusion_mode]]      
  - [-1, 2, C3k2, [head_channel, False]]      # 32 (P5_out) - Final P5 output


  - [[26, 29, 32], 1, AYHead, [nc]]  # Detect(P3, P4, P5)